package org.homework.seminar02.task03;

/**
 * Дана json строка (можно сохранить в файл и читать из файла)
 * (Коллеги, если сложно будет распарсить .json -> можно работать как со строкой обычной)
 * <p>
 * [{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},
 * {"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},
 * {"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
 * <p>
 * Написать метод(ы), который распарсит json и, используя StringBuilder,
 * создаст строки вида: Студент [фамилия] получил [оценка] по предмету [предмет].
 * <p>
 * Пример вывода:
 * Студент Иванов получил 5 по предмету Математика.
 * Студент Петрова получил 4 по предмету Информатика.
 * Студент Краснов получил 5 по предмету Физика.
 */
public class JsonParser {
}
