package org.homework.seminar03;

/**
 * Реализовать алгоритм сортировки слиянием
 *
 * Пусть дан произвольный список целых чисел, удалить из него четные числа
 *
 * Задан целочисленный список ArrayList. Найти минимальное, максимальное и среднее из этого списка.
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}